///////////////////////////////////////////////////////////////////////////////
/**
 * @file doasp_closed.cpp
 * @brief 非公開コマンドの実装ファイル
 * @author RSD S.Nagai
 * @author Copyright (C) 2016, 2017 Renesas Electronics Corporation and
 * @author Renesas System Design Co., Ltd. All rights reserved.
 * @date 2017/03/28
 */
///////////////////////////////////////////////////////////////////////////////
/*
■改定履歴
・2016/09/09
*/
#include "doasp_closed.h"
#include "protasp_cpu.h"
#include "doasp_sys_family.h"

// ファイル内static変数の宣言

// ファイル内static関数の宣言

///////////////////////////////////////////////////////////////////////////////
// static関数
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
// 初期化関数
///////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////
// RFWコマンド処理関数
///////////////////////////////////////////////////////////////////////////////
//=============================================================================
/**
 * ASP DTFIFO Write
 * @param dwWriteByte
 * @param pbyWriteBuff ライトデータ格納バッファアドレス
 * @retval RFWERR_OK  正常動作
 * @retval RFWERR_ERR エラーあり
 */
//=============================================================================
DWORD DO_AspOut(DWORD dwWriteByte, const DWORD *pbyWriteBuff)
{
	DWORD	dwRet = RFWERR_OK;

	ProtInit_ASP();
	// エミュレータ種別、BFW動作モードに対応したCPU_Rコマンドを発行(エミュレータ種別はRFW内部変数を参照)
	dwRet = ProtAspOut(dwWriteByte, pbyWriteBuff);
	ProtEnd_ASP();
	return dwRet;
}

